wiki/2016-08-05-java-test-method-time.html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://bruceasu.github.io/rss.xml"
      title="RSS feed for https://bruceasu.github.io/"/>
<title>java test method time</title>
<meta name="author" content="Bruce">
<meta name="referrer" content="no-referrer">
<link href= "/styles/org-manual.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rel="stylesheet" href="/styles/font.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/post.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/post_mobile.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/navigatebar.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/navigatebar_mobile.css">
<link rel="stylesheet" href="/theme/highlight.css">

</head>
<body>
<div class="navigatebar">
    <div class="navigatebar-button navigatebar-mine">
        <a href="/index.html">Free World</a>
    </div>
    <div class="navigatebar-slogan">
        「生活可以更简单, 欢迎来到我的开源世界」
    </div>
    <div class="navigatebar-button">
        <a href="/index.html">Home</a>
    </div>
    <div class="navigatebar-button">
        <a href="/tags.html">Tags</a>
    </div>
    <div class="navigatebar-button">
        <a href="/rss.xml">Feeds</a>
    </div>
    <div class="navigatebar-button navigatebar-about">
        <a href="/about.html">About</a>
    </div>
</div>

      <div class="content-area">
<div class="title">java test method time</div>
<div class="category-area"><a href="https://bruceasu.github.io/tags.html#java"><div class="category">java</div></a> </div>
<div class="char-counter">2016-08-05</div>
        <div id="content">
<p>
下面使用java回调函数来实现一个测试函数运行时间的工具类：
</p>

<p>
如果我们要测试一个类的方法的执行时间，通常我们会这样做：
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="font-weight: bold;">public</span> <span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">TestObject</span> {
    <span style="font-style: italic;">/**</span>
<span style="font-style: italic;">     * &#19968;&#20010;&#29992;&#26469;&#34987;&#27979;&#35797;&#30340;&#26041;&#27861;&#65292;&#36827;&#34892;&#20102;&#19968;&#20010;&#27604;&#36739;&#32791;&#26102;&#30340;&#24490;&#29615;</span>
<span style="font-style: italic;">     */</span>
    <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">testMethod</span>(){
        <span style="font-weight: bold;">for</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span>=0; i&lt;100000000; i++){

        }
    }
    <span style="font-style: italic;">/**</span>
<span style="font-style: italic;">     * &#19968;&#20010;&#31616;&#21333;&#30340;&#27979;&#35797;&#26041;&#27861;&#25191;&#34892;&#26102;&#38388;&#30340;&#26041;&#27861;</span>
<span style="font-style: italic;">     */</span>
    <span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">testTime</span>(){
        <span style="font-weight: bold; text-decoration: underline;">long</span> <span style="font-weight: bold; font-style: italic;">begin</span> = System.currentTimeMillis();<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#27979;&#35797;&#36215;&#22987;&#26102;&#38388;</span>
        testMethod();<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#27979;&#35797;&#26041;&#27861;</span>
        <span style="font-weight: bold; text-decoration: underline;">long</span> <span style="font-weight: bold; font-style: italic;">end</span> = System.currentTimeMillis();<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#27979;&#35797;&#32467;&#26463;&#26102;&#38388;</span>
        System.out.println(<span style="font-style: italic;">"[use time]:"</span> + (end - begin));<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#25171;&#21360;&#20351;&#29992;&#26102;&#38388;</span>
    }

    <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">String</span>[] <span style="font-weight: bold; font-style: italic;">args</span>) {
        <span style="font-weight: bold; text-decoration: underline;">TestObject</span> <span style="font-weight: bold; font-style: italic;">test</span>=<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">TestObject</span>();
        test.testTime();
    }
}
</pre>
</div>

<p>
大家看到了testTime()方法，就只有"//测试方法"是需要改变的，下面我们来做一个函数实
现相同功能但更灵活：
</p>

<p>
首先定一个回调接口：
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="font-weight: bold;">public</span> <span style="font-weight: bold;">interface</span> <span style="font-weight: bold; text-decoration: underline;">CallBack</span> {
    <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#25191;&#34892;&#22238;&#35843;&#25805;&#20316;&#30340;&#26041;&#27861;</span>
    <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">execute</span>();
}

</pre>
</div>

<p>
然后再写一个工具类：
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="font-weight: bold;">public</span> <span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Tools</span> {

    <span style="font-style: italic;">/**</span>
<span style="font-style: italic;">     * &#27979;&#35797;&#20989;&#25968;&#20351;&#29992;&#26102;&#38388;&#65292;&#36890;&#36807;&#23450;&#20041;CallBack&#25509;&#21475;&#30340;execute&#26041;&#27861;</span>
<span style="font-style: italic;">     * </span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">@param</span><span style="font-style: italic;"> callBack</span>
<span style="font-style: italic;">     */</span>
    <span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">testTime</span>(<span style="font-weight: bold; text-decoration: underline;">CallBack</span> <span style="font-weight: bold; font-style: italic;">callBack</span>) {
        <span style="font-weight: bold; text-decoration: underline;">long</span> <span style="font-weight: bold; font-style: italic;">begin</span> = System.currentTimeMillis();<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#27979;&#35797;&#36215;&#22987;&#26102;&#38388;</span>
        callBack.execute();<span style="font-weight: bold; font-style: italic;">///</span><span style="font-weight: bold; font-style: italic;">&#36827;&#34892;&#22238;&#35843;&#25805;&#20316;</span>
        <span style="font-weight: bold; text-decoration: underline;">long</span> <span style="font-weight: bold; font-style: italic;">end</span> = System.currentTimeMillis();<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#27979;&#35797;&#32467;&#26463;&#26102;&#38388;</span>
        System.out.println(<span style="font-style: italic;">"[use time]:"</span> + (end - begin));<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#25171;&#21360;&#20351;&#29992;&#26102;&#38388;</span>
    }

    <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">String</span>[] <span style="font-weight: bold; font-style: italic;">args</span>) {
        <span style="font-weight: bold; text-decoration: underline;">Tools</span> <span style="font-weight: bold; font-style: italic;">tool</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Tools</span>();
        tool.testTime(<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">CallBack</span>(){
            <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#23450;&#20041;execute&#26041;&#27861;</span>
            <span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">execute</span>(){
                <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#36825;&#37324;&#21487;&#20197;&#21152;&#25918;&#19968;&#20010;&#25110;&#22810;&#20010;&#35201;&#27979;&#35797;&#36816;&#34892;&#26102;&#38388;&#30340;&#26041;&#27861;</span>
                TestObject.testMethod();
            }
        });
    }

}

</pre>
</div>

<p>
大家看到，testTime()传入定义callback接口的execute()方法就可以实现回调功能
</p>

        </div>    </div>
    <div id="postamble" class="status"><div id="archive" style="padding-top: 3em; padding-bottom: 2em;"><a href="/archive.html">其它文章</a></div><script src="/js/av-min-1.5.0.js"></script>    </div>
</body>
</html>
